{"/guides/":{"data":{"":"This is a demo of the theme’s documentation layout.","hello-world#Hello, World!":" main.gopackage main import \"fmt\" func main() { fmt.Println(\"Hello, World!\") } "},"title":"Documentation"},"/guides/first-page-copy-2/":{"data":{"":"A simple demo page."},"title":"C"},"/guides/first-page-copy/":{"data":{"":"A simple demo page."},"title":"B"},"/guides/first-page/":{"data":{"":"A simple demo page."},"title":"A"},"/guides/folder/":{"data":{"":"Pages can be organized into folders."},"title":"Folder"},"/guides/folder/leaf/":{"data":{"":"This page is under a folder."},"title":"Leaf Page"},"/sad/":{"data":{"":"Einführung Die Dokumentation der Software-Architektur ist ein wesentlicher Bestandteil des Softwareentwicklungsprozesses. Dieses Software-Architektur-Dokument (SAD) dient als zentrale Quelle, um die Architektur eines Systems umfassend zu beschreiben. Es stellt sicher, dass alle relevanten Aspekte der Softwareentwicklung – von der Planung bis zur Wartung – klar dokumentiert und nachvollziehbar sind.\nDas SAD ist eine lebendige Dokumentation, die während der gesamten Projektdauer aktualisiert wird. Es bildet die Grundlage für die Kommunikation zwischen den verschiedenen Stakeholdern, erleichtert die Zusammenarbeit im Team und dient als Referenz für zukünftige Erweiterungen oder Änderungen. Darüber hinaus stellt es sicher, dass die Qualitätsanforderungen des Systems eingehalten werden.\nProjektkontext Das Projekt Algae Care wurde initiiert, um Schülerinnen und Schüler der Sekundarstufe auf interaktive und innovative Weise für die Bedeutung von Algen und deren Erhalt zu sensibilisieren. Im Rahmen einer Ausstellung des Energieunternehmens Primeo Energie wird das System als zentrales Exponat präsentiert. Es zeigt auf, wie Algen nicht nur zur nachhaltigen Energiegewinnung beitragen, sondern auch eine Schlüsselrolle im ökologischen Gleichgewicht unseres Planeten spielen.\nZiele des SAD Transparenz: Sicherstellen, dass die Architekturentscheidungen nachvollziehbar dokumentiert sind. Kommunikation: Bereitstellung eines gemeinsamen Verständnisses für alle Projektbeteiligten, einschließlich Entwicklern, Architekten und Stakeholdern. Wartbarkeit: Unterstützung der langfristigen Weiterentwicklung und Wartung des Systems. Die Architektur des Systems wurde so gestaltet, dass sie flexibel auf veränderte Anforderungen reagieren kann. Dieses Dokument stellt die notwendigen Informationen bereit, um die Struktur und die zentralen Entwurfsentscheidungen des Systems zu verstehen.\nStruktur des SAD Das SAD folgt der etablierten Struktur und umfasst folgende Kapitel:\nAufgabestellung Qualitätsziele Randbedingungen Kontextabgrenzung Bausteinsicht Laufzeitsicht Verteilungssicht Entwurfsentscheidungen Glossar Mit diesem Dokument soll sichergestellt werden, dass das Projekt sowohl im aktuellen Entwicklungsprozess als auch langfristig erfolgreich ist."},"title":"Software Architecture Documentation"},"/testing/":{"data":{"":"This is a demo of the theme’s documentation layout.","hello-world#Hello, World!":" main.gopackage main import \"fmt\" func main() { fmt.Println(\"Hello, World!\") } "},"title":"Testing"}}